package chapter11;

// === 자바 컬렉션 프레임워크 ===
// : 데이터를 저장하고 처리하는 자료구조의 표준화 된 설계 

// 컬렉션 프레임워크의 주요 인터페이스
// 1. collection
// >> 자바 컬렉션 프레임워크의 상위 인터페이스, 데이터의 집합을 다름 

// 2. List
// : 데이터의 순서를 유지O, 중복 허용O (ArrayList, LinkedList 등)

// 3. Set
// : 데이터의 순서를 유지X, 중복 허용X (HashSet, TreeSet 등)

// 4. Map 
// : 키-값 쌍으로 이루어진 데이터를 다룸, 키는 중복 허용X, 값은 중복O (HashMap, TreeMap 등) 

public class A_Collection {
		// 컬렉션 프레임워크 사용 방법 
		
		// 1. 데이터의 특성에 맞는 클래스 선택 
		// 2. 데이터의 중복에 대한 필요성, 순서 유지에 대한 필요성 점검 
		// 3. 키-값 쌍 데이터의 필요성 
}
